{
    "jobTitle": [
         {
            "title":"Creative Software Developer"


         },
        {           
            "title": "Experianced in web based development"
        },
        {           
            "title": "Learning mobile development"
        },

         {
            "title": "I Build and design games in my spare time "
         }

    ],
    "about": [
       
     "My journey to becoming a developer all started with a question: 'How does the internet actually work?' While in high school, I dabbled in a few online courses, and after graduating, I decided to attend a web development bootcamp to learn how to make websites—among other things. My passion for exploring the endless possibilities of technology led me to LC Studio, where I am eagerly expanding my skill set and knowledge. In my spare time you can find me exploring the world of linguistics, studying Japanese and Arabic, playing chess with family and friends, coding and spending time with my cats "    
    ],

    "education": [
    {
        "id": 1,
        "School1": "Life Choices Academy: Web Development Bootcamp,",
        "Year1":"April - September 2024",
        "Experiance1": "At Life Choices Academy I underwent proffessional and techincal development.The technical curriculum had a focus on Html, CSS, Bootstrap,JavaScript, VueJS, NodeJS, mySQL"

    },
    {
        "id": 2,
        "School2":  "Harvard's Cs50 Introduction to Computer Science",
        "Year2":"April 2024 - Present",
        "Experiance2":"Cs50x has been a rigourous journey of discovery.Taught mainly by Proffessor David.J Malan the course has a focus on abstraction, algorithms, data structures, encapsulation, resource management, security, software engineering, and web development. Languages include C, Python, SQL, and JavaScript plus CSS and HTML."

    },
    {
        "id": 3,
        "School3":"Khan Academy:Computer Science Course: Internet Security",
        "Year3":"December 2023 - Present",
        "Experiance3":"This course has a focus on the theoretical aspect of computer science, focusing on algorithms, cryptogoraphy and  information theory.I uncovered my affinity for cryptogoraphy and cyphers through this course."

    },
    {
        "id": 4,
        "School4": "The Leadership College Mannernberg",
        "Year4": "2018-2023",
        "Experiance4": "I graduated from The Leadership College High School in Manenberg, where navigating challenges in a difficult environment shaped my resilience, perseverance, and unwavering commitment to achieving my goals. This experience also inspired my dedication to uplifting my community and making a positive impact through my skills and work ethic."
    }
 
    ],
   
    "skills": [
    {
      "id": 5,
      "softSkill1": "Strong analytical and problem-solving abilities",
      "softSkill2": "Ability to work collaboratively in a team environment",
      "softSkill3": "Adaptability and willingness to learn new concepts"
    },
    {
       "id": 6,
      "polyglotSkill1": "English",
      "polyglotSkill2": "Afrikaans",
      "polyglotSkill3": "I have been studing arabic for three months  Arabic (ثلاثة أشهر)",
      "polyglotSkill4": "I have been studing German for eight months German (acht Monate)",
      "polyglotskill": "I have been studying Japenese for a year and a half (一年半)"
      
      
    },
    
    
{        "id": 7,
        "techSkill1": "Html",
        "techSkill2": "CSS",
        "techSkill3": "Bootstrap",
        "techSkill4": "JavaScript",
        "techSkill5": "VueJS"
    }
        
    ],
    "testimonials": [
    {
      "name": "Thuthuza",
      "surname": "Poswayo",
      "testimonial": "Nusaibah is kind, helpful and easily approachable. She is amazing to work with, she makes a great team player!",
      "profile": "https://nusaibah01.github.io/all-images/images/Thutz1.jpg"

    },
    {
        "name": "LamlaNkosi",
        "surname": "Nomnganga",
        "testimonial": "Nuisabah is an absolute gem, Calm, kind, and incredibly diligent, she embodies grace and dedication.A true team player, she is always focused on her tasks, ensuring a harmonious work environment. Additionally, she is a great person to talk to, who under pressure, perseveres until the job is done.",
        "profile": "https://nusaibah01.github.io/all-images/images/Lamla.jpg"
    },
    {
        "name": "Imraan",
        "surname": "Sheldon",
        "testimonial": "Nusaibah is a remarkable individual, embodying kindness, dedication, and intelligence in every aspect of her life. Her gentle demeanor belies a remarkable resilience and inner strength, inspiring those around her to strive for greatness. It is a privilege to know Nusaibah, and I have no doubt that she will continue to  make a positive impact on the world around her.",
        "profile": "https://nusaibah01.github.io/all-images/images/Imraan.jpg"
    },
    {
        "name": "Abdurahman",
        "surname": "Charif",
        "testimonial": "Nusaibah is a  dedicated worker that uses her insight to accomplish her goals and help those contribute to those around her.Her commitment and dedication shine through with all that she applies herself at.",
        "profile": "https://nusaibah01.github.io/all-images/images/Abdu.png"
    },
    {
        "name": "Joel",
        "surname": "Mukanya",
        "testimonial": "Nuaibah is a highly creative, well-behaved, and dedicated individual who thrives on collaborating with her peers and excels at working on project assignments. She has acquired various skills and tools, including HTML5, CSS3, Bootstrap,VS Code, and wireframe. I am pleased to introduce her as an exceptional candidate and developer",
        "profile": "https://nusaibah01.github.io/all-images/images/joel2.jpg"
    }

       
],
"projects" : [
    {
        "project": "WeatherWise",
        "description": "The final project in my Software Engineering learning journey, the WeatherWise Hackathon put my skills I'd gained to the test. Collaborating with my team, we rose to the challenge and delivered a successful solution, finishing ahead of schedule and exceeding expectations.",
        "image": "https://nusaibah1.github.io/portfolioImages/images/WeatherWise.png",
        "vercel": "https://weather-wise-sftw-eng.vercel.app/"
    },
    
    {
        "project": "Scrum Hackathon",
        "description":"Collaborated with a talented team of software engineering interns to design Slice & Stack, an innovative fast food mobile application. Leveraging scrum methodologies, we crafted a user-focused solution for an internal hackathon.",
        "image":"https://nusaibah1.github.io/portfolioImages/images/Slice&Stack.png",
        "addLinks":"https://trello.com/invite/b/67161505e75be9517fddf1c9/ATTI8d0f271668e0ac9e6695f3859b2c39feC8558C80/team-e-scrum"
     },
 

    {
        "project":"Case Study",
        "description": "At LC Studio I worked on a portfolio case study with my team of softare engineering interns and designed a UI/UX centered portfolio.",
        "image": "https://nusaibah1.github.io/portfolioImages/images/Case Study.png",
        "addLinks": "https://trello.com/invite/b/67122a36fc7809302f1e4c3a/ATTI915de7c5b54b2f92e8a0ed5d5f8dc74a3DEFD47C/team-e"
    },

    {
        "project": "WizardHome",
        "description": "Showcases my milestones through interactive gameplay, sprite animations, and a retro vibe that highlights my JavaScript skills and creativity.",
        "techStack": "HTML, CSS, Kaboom.JS",
        "image": "https://nusaibah1.github.io/portfolioImages/images/game.png",
        "github": "https://github.com/nusaibah1/Track-It.git",
        "firebase": "https://trackit-4afef.web.app/"
    },

    {
      "project": "SocialBook",
       "description": "Facebook clone built using html, css",
       "image": "https://nusaibah1.github.io/portfolioImages/images/socialBook.png",
        "techStack": "HTML, CSS, JavaScript",
       "github": "https://github.com/nusaibah1/socialBook.git",
       "vercel": "social-book-tau.vercel.app"
    },

  

   {
    "project": "Whac-A-Mole",
    "description": "",
    "image": "https://nusaibah1.github.io/portfolioImages/images/WAM.png" ,
    "techStack": "HTML, CSS, JavaScript",
    "github": "https://github.com/nusaibah1/Whac-A-Mole.git",
    "vercel": "https://whac-a-mole-seven.vercel.app/"
   }
  
   
   
    ]

}
